{
  "version": "1.1.13",
  "link": "",
  "changelog": {
    "1.0.0": "Initial alpha release",
    "1.1.0": "Initial beta release",
    "1.1.1": "Fixed name being null for new accounts. Fixed a crash with permanent markers when changing map. Fixed chat issues with null strings. Fixed numpad 3 and 9 movement on the Z axis while in 2D mode. Added the ability to pause animated gifs. Last IP/Port pair for server connections are now saved. Added automatic updater.",
    "1.1.2": "The server/client connection is now explicitly keepalive. Added a disconnected screen and a reason for disconnect. Fixed chat message crash. Made the code more robust to disconnects and general network state changes.",
    "1.1.3": "Added keepalive ping packets. Fixed a crash with turn tracker entry comparison. Added more logging for integrations. Added map backups. Added a network profiling/information tool for the server host. Added the ability to ban clients. Chat tooltips for expression rolls now explicitly show all non-nested roll results whenever possible.",
    "1.1.4": "Removed the NulEng dependency. Moved to github for version control and updates. Fixed issues with sun shadows not being in the correct position.",
    "1.1.5": "Added credits. Status effects are now always drawn for object owners. Asset uploading will not crash the app anymore. Fixed %s and other c++ formatting crashing the client in UI text. Fixed UI texture border issues. Fixed crash when changing maps while manipulating objects. Fixed server crash on client-server version mismatch. Fixed previews not generated for image assets.",
    "1.1.6": "Fixed compressed image uploading causing heap corruption. Roll tooltip generator now generates tooltips for compound rolls. Camera snap/default position now includes 2d zoom level. Added network timeout handling.",
    "1.1.7": "Fixed texture compression parameter not applying. Added a d10 option to rolls. Fixed a crash with changing object properties on a different map than other clients.",
    "1.1.8": "Major code refactoring and some optimizations. Particle surface emission is now weighted based on the total triangle area for a mesh, not just the number of triangles. Potentially fixed UI issues by making ImGui calls consistent. Fixed shader recompilation issues.",
    "1.1.9": "Fixed the hotkeys for movement being broken",
    "1.1.10": "Added shader error reporting. Fixed shaders not compiling on intel gpus. Fixed a server-side crash when clients disconnected through the ui. Added missing language entries. Optimized language translate function. Added custom name templates for objects. Added settings to disable particles. Updated dependencies. Added client secret for profile validation. Fixed the server logger being prefixed as client.",
    "1.1.11": "Added server chat backups. Updated ImGui library. Fixed gui inconsistency on right-click menu for objects for non-admins. Added user colors to network panel. Fixed incorrect camera snapping for 2D maps. Moved to modern ImGuiIO. Added tools for explicit camera control for users without MMB. Optimized the rendering pipeline to use UBOs. Changed shadows to use PCF from built-in shadow samplers and added settings to control the quality of the PCF. Added the ability to control billboarding for particle systems. Fixed a crash that could occur with custom nameplate rendering. Made particle mesh surface emission mode account for triangle area, making small triangles less likely to emit particles resulting in uniform particle emission across the mesh. Added support for various unicode characters (approx ~500). Added shader graph editor and custom shaders (not attachable to objects yet).",
    "1.1.12": "Fixed preview generation not using UBOs. Switched both server and client to use SendAsync. Moved from hardware gamma correction to explicit and allowed for its adjustment in the settings.",
    "1.1.13": "Made the updater use a new stream explicitly, may fix the corrupted directory issue. Fixed an issue with the asset browser crashing in rare circumstances. Added settings to enable/disable UBOs for old graphics cards. Padded the UBO to 416 bytes per NVidia driver complaint. Added a sun light color property."
  }
}